<?php

namespace Database\Seeders;

use App\Models\History;
use Illuminate\Database\Seeder;

class HistoriesSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $histories = array(
      array('id' => '1', 'locale' => 'ru', 'years' => '1991 - 1996', 'history' => 'Вдохновляющий путь и будущее становление Группы компаний "КОИНОТИ НАВ" началось в 1991 году с оптовых поставок продовольственных продуктов и хозяйственных товаров первой необходимости, тем самым содействуя снижению их дефицита и ассортимента, а главное, способствуя реализации цели - повышения продовольственной безопасности республики. Так начался интересный путь и развитие Группы компаний "КОИНОТИ НАВ", ставший впоследствии одной из лидеров рынка.', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-30 07:41:56'),
      array('id' => '2', 'locale' => 'ru', 'years' => '1996 - 2000', 'history' => 'Следуя стратегическим целям страны в обеспечении продовольственной безопасности и отвечая на вызовы, компания придает стимул направлению, инвестируя в предприятия по производству собственных продуктов питания и хозяйственных товаров. Важно отметить, в 1996 году свою фармацевтическую деятельность энергично начала компания «ДУСТИ ФАРМА», занимаясь дистрибуцией импортных лекарственных средств, последовательно расширяя сеть оптовых и розничных аптек на территории Республики Таджикистан.', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-27 09:26:44'),
      array('id' => '3', 'locale' => 'ru', 'years' => '2000 - 2004', 'history' => 'Благодаря усердной работе и четкой маркетинговой стратегии, фармацевтическое направление выходит на первые позиции в области реализации поставок лекарственных средств и медицинской техники на внутренний рынок. Создается широкая сеть розничных аптек под брендом "МАДАД ФАРМ", открывается фармацевтический складской комплекс, отвечающий мировым стандартам, площадью около 7 000 кв.м. Ассортимент лекарственных препаратов и медицинской техники насчитывает более 10 000 наименований.', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-30 07:42:34'),
      array('id' => '4', 'locale' => 'ru', 'years' => '2004 - 2008', 'history' => 'Приоритетными сферами деятельности становятся национальные стратегические сектора экономики, нуждающиеся в импульсе. В результате, Советом Директоров Группы компаний "КОИНОТИ НАВ" было принято единогласное решение о создании ряда организаций для рационального соединения факторов производства и комплексного оказания услуг, а также с целью увеличения количества новых высокопроизводительных рабочих мест, что определенно способствует привлечению иностранных инвестиций.', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-30 07:42:48'),
      array('id' => '5', 'locale' => 'ru', 'years' => '2008 - 2014', 'history' => 'Успешно действующих и динамично развивающихся компаний в составе "КОИНОТИ НАВ" в разных сферах бизнеса становится больше. Следуя тенденциям рынка и его потребностям, анонсируются намерения о планомерном выходе на внешние рынки с зарубежными партнерами. ООО "TajMotors" заключает дилерский договор с всемирно известным производителем автомобилей "TOYOTA". Свою деятельность в сфере розничного ритейла начала компания «ЁВАР», в основе бизнес-философии которой заложены высокое качество, свежесть продукции и должное обслуживание.', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-30 07:43:02'),
      array('id' => '6', 'locale' => 'ru', 'years' => '2014 - 2020', 'history' => 'Почти за два десятилетия активной деятельности Группа компаний расширилась и укрепила свои позиции на рынке. Компании, опираясь на накопленный опыт и знания, активно внедряют современные технологии и инновации, актуализируя и обновляя стратегические цели. Заключаются партнерские договоры и контракты. Получен официальный статус Франчайзи компании 1С. В столице республики открывается современный мебельный салон "ХОНАИ МАН", являющийся официальным дилером датского производителя мебели "JYSK".', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-30 07:43:16'),
      array('id' => '7', 'locale' => 'ru', 'years' => '2020 - 2022', 'history' => 'Руководствуясь национальной стратегией повышения просвещенности среди населения, реализован научно-образовательный проект "ХИРАД", с целью роста профессионализма среди сотрудников создается внутрикорпоративный бизнес-тренинг центр "AtS". В годы пандемии COVID-19, разработан и реализован проект интернет-аптеки "САЛОМАТ". "КОИНОТИ НАВ" — это Группа компаний, объединяющая успешные компании и проекты, с сотнями сотрудников, объединенных единой Миссией, с неугасающим стремлением всесторонне развиваться во благо общества.', 'created_at' => '2022-08-21 18:02:53', 'updated_at' => '2022-08-30 07:43:27')
    );

    foreach ($histories as $history) {
      History::create([
        'years' => $history['years'],
        'history' => $history['history']
      ]);
    }
  }
}
