export const FinanceTest = [
  {
    question: 'Финансовая система- это:',
    choices: [
      'совокупность различных финансовых отношений',
      'центральный банк и министерство финансов',
      'форма организации денежных отношений между всеми субъектами воспроизводственного процесса',
      'совокупность учреждений и организаций, однородных по своим задачам',
    ],
    answer: 'совокупность различных финансовых отношений',
    userAnswer: '',
  },
  {
    question: 'Выбери правильный ответ. Что представляет собой процесс управления финансами:',
    choices: [
      'процесс перераспределения финансовых ресурсов в рамках финансового состояния',
      'механизм регулирования доходов работающего населения',
      'контроль за эмиссией бумажных денег в стране',
      'контроль за перемещением денег в другие страны',
    ],
    answer: 'процесс перераспределения финансовых ресурсов в рамках финансового состояния',
    userAnswer: '',
  },
  {
    question: 'Назовите, что не входит в расходные статьи бюджета:',
    choices: [
      'расходы на национальную оборону',
      'расходы на содержание государственного аппарата',
      'обслуживание внешнего государственного долга',
      'расходы на содержание промышленных предприятий',
    ],
    answer: 'расходы на содержание промышленных предприятий',
    userAnswer: '',
  },
  {
    question: 'Что такое Профицит бюджета:',
    choices: [
      'превышение доходов над расходами',
      'разница между доходами и инвестициями',
      'превышение расходов над доходами',
      'разница между ВВП и национальным доходом',
    ],
    answer: 'превышение доходов над расходами',
    userAnswer: '',
  },
  {
    question: 'Какие виды ценных бумаг выпускаются государством:',
    choices: [
      'акции',
      'облигации',
      'векселя',
      'банкноты',
    ],
    answer: 'облигации',
    userAnswer: '',
  },
  {
    question: 'По отношению к собственнику финансы делятся на',
    choices: [
      'государственные, корпоративные, личные',
      'наличные, безналичные',
      'рублевые и валютные',
      'собственные, заемные, привлеченные',
    ],
    answer: 'государственные, корпоративные, личные',
    userAnswer: '',
  },
  {
    question: 'Философия и предназначение организации, смысл ее существования на рынке, отличие организации от остальных организаций носит название',
    choices: [
      'видение',
      'миссия',
      'программа',
      'цель',
    ],
    answer: 'миссия',
    userAnswer: '',
  },
  {
    question: 'Вторичными ценными бумагами являются',
    choices: [
      'акции',
      'векселя',
      'облигации',
      'фьючерсы',
    ],
    answer: 'облигации',
    userAnswer: '',
  },
  {
    question: 'По признаку права участия в управлении корпорацией различают акции',
    choices: [
      'именные и предъявительские',
      'корпоративные и акции, выпускаемые кредитными учреждениями',
      'обыкновенные и привилегированные',
      'документарные и бездокументарные',
    ],
    answer: 'обыкновенные и привилегированные',
    userAnswer: '',
  },
  {
    question: 'Какой из отчетов является “снимок” предприятия на определенную дату и в отличие от других предоставляет информацию не за определённый период, а по состоянию на конкретный момент?',
    choices: [
      'Отчет о движение денежных средств;',
      'Отчет о собственном капитале;',
      'Отчет о финансовых результатах;',
      'Баланс',
    ],
    answer: 'Баланс',
    userAnswer: '',
  },
];
