export const RussianTest = [
  {
    question: 'Обычно я ________ дома.',
    choices: [
      'поужинал',
      'буду ужинать',
      'ужинаю',
    ],
    answer: 'ужинаю',
    userAnswer: '',
  },
  {
    question: 'Почему тебе не ________ эта книга?',
    choices: [
      'нравится',
      'нравиться',
      'нравишься',
    ],
    answer: 'нравится',
    userAnswer: '',
  },
  {
    question: 'Мы ________ завтра этот новый фильм?',
    choices: [
      'смотришь',
      'смотрим',
      'посмотрим',
    ],
    answer: 'посмотрим',
    userAnswer: '',
  },
  {
    question: 'Мне очень ________ твоя помощь.',
    choices: [
      'нужна',
      'нужен',
      'нужны',
    ],
    answer: 'нужна',
    userAnswer: '',
  },
  {
    question: 'Банк сегодня  ________. Я пойду туда завтра.',
    choices: [
      'закрыто',
      'закрыт',
      'закрыта',
    ],
    answer: 'закрыт',
    userAnswer: '',
  },
  {
    question: '________ сейчас занята. Позвоните через час.',
    choices: [
      'Ей',
      'Её',
      'Она',
    ],
    answer: 'Она',
    userAnswer: '',
  },
  {
    question: '________ сказали результаты экзамена?',
    choices: [
      'У тебя',
      'Тебе',
      'Тебя',
    ],
    answer: 'Тебе',
    userAnswer: '',
  },
  {
    question: '_________ говорили с тобой по-русски?',
    choices: [
      'Они',
      'Он',
      'Она',
    ],
    answer: 'Они',
    userAnswer: '',
  },
  {
    question: 'Извините, вы не знаете, где главная ________?',
    choices: [
      'аудиторию',
      'аудитория',
      'аудиторий',
    ],
    answer: 'аудитория',
    userAnswer: '',
  },
  {
    question: 'Передай, пожалуйста, эту книгу ________.',
    choices: [
      'Марину',
      'Марина',
      'Марине',
    ],
    answer: 'Марине',
    userAnswer: '',
  },
];
